'''
МПЗ
'''
from engineers_src.Devices.Device import Device
from engineers_src.Devices.functions import print_start_and_end, sendFromJson, executeTMI, doEquation
from engineers_src.tools.ivk_script_tools import *
from engineers_src.tools.tools import SCPICMD, AsciiHex, KPA, SOTC, SKPA, Ex, sleep, OBTS,CPIMD, ClassInput

#time+4c
def vklMROD1(time):
    #БСпА 1-ый комплект подать питание (+300 мА)
    SCPICMD(0x40DD, OBTS (time)) #Замкнуть ключ КПТ на БСпА 1
    sleep(1)
    SCPICMD(0x5320, OBTS (2), AsciiHex('0x 0100 0000 0000 0000')) #Выдать потенциальную команду (+Ubs от КПТ) в БСпАосн
    sleep(1)
    SCPICMD(0xe06f, OBTS (2), AsciiHex('0x 0601 0000 0000 0000'))#включение обмена БСпА1
    sleep(1)
    return

def vklMROD2(time):
    #БСпА 2-ый комплект подать питание (+300 мА)
    SCPICMD(0x41A5,  OBTS (time)) #Замкнуть ключ КПТ на БСпА 2
    sleep(1)
    SCPICMD(0x5320, OBTS (2), AsciiHex('0x 0200 0000 0000 0000')) #Выдать потенциальную команду (+Ubs от КПТ) в БСпАрез
    sleep(1)
    SCPICMD(0xe06f, OBTS (2), AsciiHex('0x 0701 0000 0000 0000'))#включение обмена БСпА2
    sleep(1)
    return

#165 c
def MROD12321():
    SCPICMD(0x6000, OBTS (5), AsciiHex('0x0200000000000000')) #Включение режима "Подготовка к съемке"
    sleep(1)
    SCPICMD(0x6000, OBTS (45), AsciiHex('0x0300000000000000')) #Включение режима "Cъемка"
    sleep(1)
    SCPICMD(0x6000, OBTS (100), AsciiHex('0x0200000000000000')) #Включение режима "Подготовка к съемке"
    sleep(1)
    SCPICMD(0x6000, OBTS (15), AsciiHex('0x0100000000000000')) #Включение режима "Дежурный. Ожидани
    sleep(1)
    return

#165 c
def MROD212321():
    SCPICMD(0x7000, OBTS (5), AsciiHex('0x0200000000000000')) #Включение режима "Подготовка к съемке"
    sleep(1)
    SCPICMD(0x7000, OBTS (45), AsciiHex('0x0300000000000000')) #Включение режима "Cъемка"
    sleep(1)
    SCPICMD(0x7000, OBTS (100), AsciiHex('0x0200000000000000')) #Включение режима "Подготовка к съемке"
    sleep(1)
    SCPICMD(0x7000, OBTS (15), AsciiHex('0x0100000000000000')) #Включение режима "Дежурный. Ожидани
    sleep(1)
    return

#188 c
def MROD14541():
    sleep(1)
    SCPICMD(0x6000, OBTS (5), AsciiHex('0x0400000000000000')) #Включение режима "Подготовка к сбросу"
    sleep(1)
    SCPICMD(0x6000, OBTS (80), AsciiHex('0x0500000000000000'))#Включение режима "Cброс"
    sleep(1)
    SCPICMD(0x6000, OBTS (90), AsciiHex('0x0400000000000000')) #Включение режима "Подготовка к сбросу"
    sleep(1)
    Ex.send('КПА', CPIMD(addr=0x7E, data=AsciiHex('0x64311500200000000000'), std=2)) #на 778  запрос (ДИ-5: Счетчик ПЛИС обмена по ВС каналам (приходит 3 пакета)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x7E00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    Ex.send('КПА', CPIMD(addr=0x88, data=AsciiHex('0x64311500800000000000'), std=2)) #на 778  запрос (ДИ-7: Конфигурация НС/ВС каналов обмена)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x8800000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    Ex.send('КПА', CPIMD(addr=0x92, data=AsciiHex('0x64311500000100000000'), std=2)) #на 778  запрос (ДИ-8: счетчики НС декодирования/кодирования)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x9200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    SCPICMD(0x6000, OBTS (10), AsciiHex('0x0100000000000000')) #Включение режима "Дежурный. Ожидание загрузки МПЗ"
    sleep(1)
    return

def MROD214541():
    sleep(1)
    SCPICMD(0x7000, OBTS (5), AsciiHex('0x0400000000000000')) #Включение режима "Подготовка к сбросу"
    sleep(1)
    SCPICMD(0x7000, OBTS (80), AsciiHex('0x0500000000000000'))#Включение режима "Cброс"
    sleep(1)
    SCPICMD(0x7000, OBTS (90), AsciiHex('0x0400000000000000')) #Включение режима "Подготовка к сбросу"
    sleep(1)
    Ex.send('КПА', CPIMD(addr=0x7E, data=AsciiHex('0x64391500200000000000'), std=2)) #на 778  запрос (ДИ-5: Счетчик ПЛИС обмена по ВС каналам (приходит 3 пакета)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x7E00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    Ex.send('КПА', CPIMD(addr=0x88, data=AsciiHex('0x64391500800000000000'), std=2)) #на 778  запрос (ДИ-7: Конфигурация НС/ВС каналов обмена)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x8800000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    Ex.send('КПА', CPIMD(addr=0x92, data=AsciiHex('0x64391500000100000000'), std=2)) #на 778  запрос (ДИ-8: счетчики НС декодирования/кодирования)
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x9200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    SCPICMD(0x7000, OBTS (10), AsciiHex('0x0100000000000000')) #Включение режима "Дежурный. Ожидание загрузки МПЗ"
    sleep(1)
    return


#5 c
def OtklKy():
    #Откючение КППИ осн (-450 мА)
    SCPICMD(0x43FF, OBTS (1), AsciiHex('0x 0000 0000')) #Снять питанние с Ku
    sleep(1)
    SCPICMD(0x5321, OBTS (1),AsciiHex('0x 0500 0000 0000 0000')) #Выдать потенциальную команду на откл. Ku осн
    sleep(1)
    SCPICMD(0x43F7, OBTS (1), AsciiHex('0x 0000 0000')) #Снять питанние с НРЛ-Р
    sleep(1)
    SCPICMD(0x5321, OBTS (1), AsciiHex('0x 0700 0000 0000 0000')) #Выдать потенциальную команду  на откл. P осн
    sleep(1)
    #М-778Б снять питание (-500 мА)
    SCPICMD(0x43EB, OBTS (1), AsciiHex('0x 0000 0000'))#отключение М-778Б
    sleep(1)
    return

#43 c
def OtklMROD():
    #БСпА снять питание (-300 мА)
    SCPICMD(0xe06f, OBTS (40), AsciiHex('0x 0600 0000 0000 0000'))#отключение обмена БСпА1
    sleep(1)
    SCPICMD(0x43FD, OBTS (1))#Разомкнуть ключ КПТ на БСпА
    sleep(1)
    SCPICMD(0x5321, OBTS (1), AsciiHex('0x 0100 0000 0000 0000')) #Снять потенциальную команду с БСпАосн
    sleep(1)
    SCPICMD(0xe06f, OBTS (1), AsciiHex('0x 0700 0000 0000 0000'))#отключение обмена БСпА2
    return

#75 c
def vklky():
    #БСпА1 (УВ1, УВ2) включить обмен по UARTосновной с М-778Б основной
    SCPICMD(0x6002, OBTS (10), AsciiHex('0x0500000000000000')) #Переключение текущий МППД на основной
    sleep(1)
    SCPICMD(0x6001, OBTS (1), AsciiHex('0x0501000000000000')) #Закрытие UART2 c 2-ым комплектом М-778Б
    sleep(1)
    SCPICMD(0x6001, OBTS (1), AsciiHex('0x0500010000000000')) #Открытие UART1 c 1-ым комплектом М-778Б
    sleep(1)
    #БСпА1 текущие = основной MODEMP_UD и основной MPPI_SW
    SCPICMD(0x6002, OBTS (1), AsciiHex('0x0800000000000000')) #Переключение текущий MODEMP_UD на основной
    sleep(1)
    SCPICMD(0x6002, OBTS (1), AsciiHex('0x0900000000000000')) #Переключение текущий MPPI_SW на основной
    sleep(1)
    SCPICMD(0x6002, OBTS (1), AsciiHex('0x0400000000000000')) #Переключение текущий KAPU на основной
    sleep(1)
    #М-778Б  1-ый комплект подать питание (+500 мА)
    SCPICMD(0x40CB, OBTS (1), AsciiHex('0x 0000 0000')) #Замкнуть ключ КПТ на М-778Босновной
    sleep(1)
    #включение основной КППИ (КАПУ)
    SCPICMD(0x4017, OBTS (1), AsciiHex('0x 0000 0000')) #Подать питанние на Ku по умолчанию
    sleep(1)
    SCPICMD(0x5320, OBTS (1), AsciiHex('0x 0500 0000 0000 0000')) #Выдать потенциальную команду на вкл. Ku осн
    sleep(1)
    #Включение  основного p модема
    SCPICMD(0x400F, OBTS (1), AsciiHex('0x 0000 0000')) #Подать питанние на НРЛ-Р по умолчанию
    sleep(1)
    SCPICMD(0x5320, OBTS (1), AsciiHex('0x 0700 0000 0000 0000')) #Выдать потенциальную команду на вкл. P осн
    sleep(1)
    #ping
    Ex.send('КПА', CPIMD(addr=0x42, data=AsciiHex('0x64311F00000000000000'), std=2)) #на 778  в бцк (6 мрод)пинг
    sleep(1)
    SCPICMD(0xe051, OBTS (60), AsciiHex('0x4200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация НС МРОД 1 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x4C, data=AsciiHex('0x64311000000000000000'), std=2)) #на 778  активировать НС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x4C00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация НС МППИ1 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x56, data=AsciiHex('0x64311200000000000000'), std=2)) #на 778  активировать НС МППИ ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x5600000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активировать ВС МППИ1 ПК1
    Ex.send('КПА', CPIMD(addr=0x60, data=AsciiHex('0x64310800000000000000'), std=2)) #на 778  активировать ВС МППИ1 ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6000000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активировать ВС МРОД1 ПК1
    Ex.send('КПА', CPIMD(addr=0x6A, data=AsciiHex('0x64310600000000000000'), std=2)) #на 778  активировать ВС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6A00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация ключей
    Ex.send('КПА', CPIMD(addr=0x74, data=AsciiHex('0x64311600010009010000'), std=2)) #на 778 в бцк (6 мрод) установка кли 1 набор 1 серия: 02 Номер  ключа в наборе 09 год набора 01 набор ключа
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x7400000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    return

#75 c
def vklky2():
    #БСпА2  (УВ1, УВ2) включить обмен по UARTрезервный с М-778Брезервный
    SCPICMD(0x7002, OBTS (10), AsciiHex('0x0501000000000000')) #Переключение текущий МППД на резервный
    sleep(1)
    SCPICMD(0x7001, OBTS (1), AsciiHex('0x0500000000000000')) #Закрытие UART1 c 1-ым комплектом М-778Б
    sleep(1)
    SCPICMD(0x7001, OBTS (1), AsciiHex('0x0501010000000000')) #Открытие UART2 c 2-ым комплектом М-778Б
    sleep(1)
    #БСпА2 текущие = резервный MODEMP_UD и  резервный MPPI_SW
    SCPICMD(0x7002, OBTS (1), AsciiHex('0x0801000000000000')) #Переключение текущий MODEMP_UD на резервный
    sleep(1)
    SCPICMD(0x7002, OBTS (1), AsciiHex('0x0901000000000000')) #Переключение текущий MPPI_SW на резервный
    sleep(1)
    SCPICMD(0x7002, OBTS (1), AsciiHex('0x0401000000000000')) #Переключение текущий KAPU на резервный
    sleep(1)
    #М-778Б  2-ой комплект подать питание (+500 мА)
    SCPICMD(0x4193, OBTS(1), AsciiHex('0x 0000 0000')) #Замкнуть ключ КПТ на М-778Брезервный
    sleep(1)
    #включение резервной КППИ (КАПУ)
    SCPICMD(0x41A7, OBTS(1), AsciiHex('0x 0000 0000')) #Подать питанние на Ku по умолчанию
    sleep(1)
    SCPICMD(0x5320, OBTS(1), AsciiHex('0x 0600 0000 0000 0000')) #Выдать потенциальную команду на вкл. Ku рез
    sleep(1)
    #Включение  резервного p модема
    SCPICMD(0x419F, OBTS(1), AsciiHex('0x 0000 0000')) #Подать питанние на НРЛ-Р по умолчанию
    sleep(1)
    SCPICMD(0x5320, OBTS(1), AsciiHex('0x 0800 0000 0000 0000')) #Выдать потенциальную команду на вкл. P рез
    sleep(1)
    #ping
    Ex.send('КПА', CPIMD(addr=0x42, data=AsciiHex('0x64391F00000000000000'), std=2)) #на 778  в бцк (6 мрод)пинг
    sleep(1)
    SCPICMD(0xe051, OBTS (60), AsciiHex('0x4200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация НС МРОД 2 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x4C, data=AsciiHex('0x64391100000000000000'), std=2)) #на 778  активировать НС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x4C00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация НС МППИ1 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x56, data=AsciiHex('0x64391200000000000000'), std=2)) #на 778  активировать НС МППИ ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x5600000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активировать ВС МППИ1 ПК2
    Ex.send('КПА', CPIMD(addr=0x60, data=AsciiHex('0x64390900000000000000'), std=2)) #на 778  активировать ВС МППИ1 ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6000000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активировать ВС МРОД1 ПК2
    Ex.send('КПА', CPIMD(addr=0x6A, data=AsciiHex('0x64390700000000000000'), std=2)) #на 778  активировать ВС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6A00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация ключей
    Ex.send('КПА', CPIMD(addr=0x74, data=AsciiHex('0x64391600010009010000'), std=2)) #на 778 в бцк (6 мрод) установка кли 1 набор 1 серия: 02 Номер  ключа в наборе 09 год набора 01 набор ключа
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x7400000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    return

#74 c
def vklrlci():
    #включение рлци без ум
    SCPICMD(0xE004, OBTS (10), AsciiHex('0113010000000000'))  # ЭА332-О питание опрос
    sleep(1)
    SCPICMD(0xA018, OBTS (1)) # ОСТАН ШД
    sleep(1)
    SCPICMD( 0xE004, OBTS (1), AsciiHex('0111010000000000'))  # ЭА331-О питание опрос
    sleep(1)
    SCPICMD(0xA000, OBTS (1)) # ПЧ-О
    sleep(1)
    SCPICMD(0xA003, OBTS (1)) # ФИП-О
    sleep(1)
    SCPICMD(0xA006, OBTS (1)) # МОД-О
    sleep(1)
    #М-778Б  1-ый комплект подать питание (+500 мА)
    SCPICMD(0x40CB, OBTS (1), OBTS('2000:1:1:0:0:0'), AsciiHex('0x 0000 0000')) #Замкнуть ключ КПТ на М-778Босновной
    sleep(1)
    #БСпА1 (УВ1, УВ2) включить обмен по UARTосновной с М-778Б основной
    SCPICMD(0x6002, OBTS (1), AsciiHex('0x0500000000000000')) #Переключение текущий МППД на основной
    sleep(1)
    SCPICMD(0x6001, OBTS (1), AsciiHex('0x0501000000000000')) #Закрытие UART2 c 2-ым комплектом М-778Б
    sleep(1)
    SCPICMD(0x6001, OBTS (1), AsciiHex('0x0500010000000000')) #Открытие UART1 c 1-ым комплектом М-778Б
    sleep(1)
    #инициализация НС МРОД 1 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x42, data=AsciiHex('0x64311000000000000000'), std=2)) #на 778  активировать НС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (60), AsciiHex('0x4200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #ping на М-778Б
    Ex.send('КПА', CPIMD(addr=0x4C, data=AsciiHex('0x64311F00000000000000'), std=2)) #на 778  в бцк (6 мрод)пинг
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x4C00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активация ВС МРОД ПК1
    Ex.send('КПА', CPIMD(addr=0x56, data=AsciiHex('0x64310600000000000000'), std=2)) #на 778  активировать ВС МРОД ПК1
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x5600000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активация ВС РЛЦИ ПК1
    Ex.send('КПА', CPIMD(addr=0x60, data=AsciiHex('0x64310E00000000000000'), std=2)) #на 778  активировать ВС РЛЦИ ПК1
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6000000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
    #инициализация ключей
    Ex.send('КПА', CPIMD(addr=0x6A, data=AsciiHex('0x64311600010009010000'), std=2)) #на 778 в бцк (6 мрод) установка кли 1 набор 1 серия: 02 Номер  ключа в наборе 09 год набора 01 набор ключа
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6A00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1.5)
 #9 c
def OtklRlci():
    #М-778Б снять питание (-500 мА)
    SCPICMD(0x43EB, OBTS(1), AsciiHex('0x 0000 0000'))#отключение М-778Б
    # ОТКЛЮЧЕНИЕ
    SCPICMD(0xA00B, OBTS(1)) # УМ
    sleep(1)
    SCPICMD(0xA008, OBTS(1)) # МОД
    sleep(1)
    SCPICMD(0xA005, OBTS(1)) # ФИП
    sleep(1)
    SCPICMD(0xA002, OBTS(1)) # ПЧ
    sleep(1)
    SCPICMD( 0xE005, OBTS(1), AsciiHex('0111000000000000')) # Снять питание ЭА331
    sleep(1)
    SCPICMD(0xE005, OBTS(1), AsciiHex('0113000000000000'))  # Снять питание ЭА332
    sleep(1)

    return

def vklrlci2():
    #включение рлци 2 без ум
    SCPICMD(0xE004, OBTS (10), AsciiHex('0113020000000000'))  # ЭА332-Р питание опрос
    sleep(1)
    SCPICMD(0xA018, OBTS (1)) # ОСТАН ШД
    sleep(1)
    SCPICMD( 0xE004, OBTS (1), AsciiHex('0111020000000000'))  # ЭА331-Р питание опрос
    sleep(1)
    SCPICMD(0xA001, OBTS (1)) # ПЧ-Р
    sleep(1)
    SCPICMD(0xA004, OBTS (1)) # ФИП-Р
    sleep(1)
    SCPICMD(0xA007, OBTS (1)) # МОД-Р
    sleep(1)
    #БСпА2 (УВ1, УВ2) включить обмен по UARTрезервный с М-778Брезервный
    SCPICMD(0x7002, OBTS (1), AsciiHex('0x0501000000000000')) #Переключение текущий МППД на резервный
    sleep(1)
    SCPICMD(0x7001, OBTS (1), AsciiHex('0x0500000000000000')) #Закрытие UART1 c 1-ым комплектом М-778Б
    sleep(1)
    SCPICMD(0x001, OBTS (1), AsciiHex('0x0501010000000000')) #Открытие UART2 c 2-ым комплектом М-778Б
    #М-778Б  2-ой комплект подать питание (+500 мА)
    sleep(1)
    SCPICMD(0x4193, OBTS (1),  AsciiHex('0x 0000 0000')) #Замкнуть ключ КПТ на М-778Брезервный
    #на 778  активировать НС МРОД ПК2
    sleep(1)
    Ex.send('КПА', CPIMD(addr=0x42, data=AsciiHex('0x64391100000000000000'), std=2)) #на 778  активировать НС МРОД ПК2
    sleep(1)
    SCPICMD(0xe051, OBTS (60), AsciiHex('0x4200000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #ping на М-778Б
    Ex.send('КПА', CPIMD(addr=0x4C, data=AsciiHex('0x64391F00000000000000'), std=2)) #на 778  в бцк (6 мрод)пинг
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x4C00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активация ВС МРОД ПК2
    Ex.send('КПА', CPIMD(addr=0x56, data=AsciiHex('0x64390700000000000000'), std=2)) #на 778  активировать ВС МРОД ПК2
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x5600000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #активация ВС РЛЦИ ПК2
    Ex.send('КПА', CPIMD(addr=0x60, data=AsciiHex('0x64390F00000000000000'), std=2)) #на 778  активировать ВС РЛЦИ ПК2
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6000000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    #инициализация ключей
    Ex.send('КПА', CPIMD(addr=0x6C, data=AsciiHex('0x64391600010009010000'), std=2)) #на 778 в бцк (6 мрод) установка кли 1 набор 1 серия: 02 Номер  ключа в наборе 09 год набора 01 набор ключа
    sleep(1)
    SCPICMD(0xe051, OBTS (1), AsciiHex('0x6C00000001000000')) #выдача команды от бцк-мрод-778
    sleep(1)
    return


def launch():
    input = ClassInput.getInputFoo()
    while True:
        print(
            '''
            
            Выберите дальнейшее действие:
            1 -- задать МПЗ
            2 -- завершить
        ''')
        d = input('')
        if d == '1':
            print('Введите количество секунд до начала МПЗ')
            time = int(input(''))
            print('Задайте номер МРОД на каком будете работать')
            print(
                '''
                
                Выберите номер МРОД:
                1 -- МРОД1
                2 -- МРОД2
            ''')
            MROD = input('')


            if MROD == '1':
                print(
                '''
                
                Выберите тип МПЗ:
                1 -- МПЗ на сьемку
                2 -- МПЗ на сброс
                ''')
                MPZ = input('')
                if MPZ == '1':
                    print('''
                         Задайте тип МПЗ на съемку для МРОД1:
                        0 -- МПЗ съемки 1001 - стирание памяти (+238c)
                        1 -- МПЗ съемки 304 (градиент, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) (+238c)
                        2 -- МПЗ съемки 305 (ПСП, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) (+238c)
                        3 -- МПЗ съемки 306 (тест матриц, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) (+238c)
                        ''')
                    MPZ1 = input('')
                    if MPZ1 == '0':
                        vklMROD1(time)
                        #1001 очистка
                        Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 E903 0000 0000 0000 0000 0000 F401 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 006D'), std=2)) #
                        sleep(1)
                        SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                        sleep(1)
                        MROD12321()
                        OtklMROD()
                    elif MPZ1 == '1':
                        vklMROD1(time)
                        #МПЗ 304 (съемка: градиент, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек)
                        Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 3001 0000 0000 0000 0000 0000 F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 006F'), std=2)) #
                        sleep(1)
                        SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                        sleep(1)
                        MROD12321()
                        OtklMROD()
                    elif MPZ1 == '2':
                        vklMROD1(time)
                        sleep(1)
                        #МПЗ 305 (съемка: ПСП, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек)
                        Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 3101 0100 0000 0000 0000 0000 F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0099'), std=2)) #
                        sleep(1)
                        SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                        sleep(1)
                        MROD12321()
                        OtklMROD()
                    elif MPZ1 == '3':
                        vklMROD1(time)
                        #МПЗ 306 (съемка: тест матриц, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек)
                        Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 3201 0300 0000 0000 0000 0000 F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0015'), std=2)) #
                        sleep(1)
                        SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                        sleep(1)
                        MROD12321()
                        OtklMROD()
                elif MPZ == '2':
                    print('''
                    Задайте тип МПЗ на сброс для МРОД1:
                        4 -- МПЗ сброса 304 по ку (+353 c)
                        5 -- МПЗ сброса 304 по х (+364 c)
                        6 -- МПЗ сброса 305 по ку (+353 c)
                        7 -- МПЗ сброса 305 по х (+364 c)
                        8 -- МПЗ сброса 306 по ку (+353 c)
                        9 -- МПЗ сброса 306 по х  (+364 c)
                        10 -- МПЗ съемки 307 (градиент, без сжатия, экспозиция - 0 мсек, длительность - 10 000 мсек) (+238c)
                        11 -- МПЗ съемки 308 (градиент, без сжатия, экспозиция - 0 мсек, длительность - 65 000 мсек) (+238c)
                        12 -- МПЗ сброса 307 по х (+364 c)
                        13 -- МПЗ сброса 308 по х (+364 c)
                        14 -- МПЗ сброса 307 по ку (+353 c) обе поляризации
                        15 -- МПЗ сброса 308 по ку (+353 c) обе поляризации
                        16 -- МПЗ сброса 307 по ку (+353 c) левая поляризация
                        17 -- МПЗ сброса 308 по ку (+353 c) левая поляризация
                        18 -- МПЗ сброса 307 по ку (+353 c) правая поляризация
                        19 -- МПЗ сброса 308 по ку (+353 c) правая поляризация
                        ''')
                    MPZ1 = input('')
                    if MPZ1 == '4':
                        vklMROD1(time)
                        vklky()
                        #Сброс тестового МПЗ №304 (съемка в режиме 0 - градиент 60 с) обе поляризации
                        Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3001 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0004'), std=2)) #
                        sleep(1)
                        SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                        sleep(1)
                        SCPICMD(0x6003, OBTS (5))
                        MROD14541()
                        OtklKy()
                        OtklMROD()
                    elif MPZ1 == '5':
                            vklMROD1(time)
                            vklrlci()
                            #Сброс тестового МПЗ №304 (съемка в режиме 0 - градиент 60 с)
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3001 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 008E'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0xA009, OBTS (15)) # УМ-О
                            sleep(1)
                            MROD14541()
                            OtklRlci()
                            OtklMROD()
                    elif MPZ1 == '6':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №305 (съемка в режиме 1 - ПСП 60 с) обе поляризации
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3101 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0055'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '7':
                            vklMROD1(time)
                            vklrlci()
                            #Сброс тестового МПЗ №305 (съемка в режиме 0 - ПСП 60 с)
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3101 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00DF'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0xA009, OBTS (15)) # УМ-О
                            sleep(1)
                            MROD14541()
                            OtklRlci()
                            OtklMROD()
                    elif MPZ1 == '8':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №306 (съемка в режиме 3 - тест матриц 60 с) обе поляризации
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3201 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00A6'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '9':
                            vklMROD1(time)
                            vklrlci()
                            #Сброс тестового МПЗ №306 (съемка в режиме 3 - тест матриц 60 с)
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3201 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 002C'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0xA009, OBTS (15)) # УМ-О
                            sleep(1)
                            MROD14541()
                            OtklRlci()
                            OtklMROD()
                    elif MPZ1 == '10':
                            vklMROD1(time)
                            #МПЗ 307 (съемка: градиент, без сжатия, экспозиция - 0 мсек, длительность - 10 000 мсек)
                            Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 3301 0000 0000 0000 0000 0000 F401 0000 0000 0000 0000 1027 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00EE'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                            sleep(1)
                            MROD12321()
                            OtklMROD()
                    elif MPZ1 == '11':
                            vklMROD1(time)
                            #МПЗ 308 (съемка: градиент, без сжатия, экспозиция - 0 мсек, длительность - 65 000 мсек)
                            Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4030 0030 3401 0000 0000 0000 0000 0000 F401 0000 0000 0000 0000 E8FD 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00E3'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                            sleep(1)
                            MROD12321()
                            OtklMROD()
                    elif MPZ1 == '12':
                            vklMROD1(time)
                            vklrlci()
                            #Сброс тестового МПЗ №307 (съемка в режиме 0 - градиент 10 с)
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3301 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 007D'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0xA009, OBTS (15)) # УМ-О
                            sleep(1)
                            SCPICMD(0xA00F, OBTS(5), AsciiHex('0x 0000 0000')) #M1
                            sleep(1)
                            MROD14541()
                            OtklRlci()
                            OtklMROD()
                    elif MPZ1 == '13':
                            vklMROD1(time)
                            vklrlci()
                            #Сброс тестового МПЗ №308 (съемка в режиме 0 - градиент 65 с)
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3401 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00FB'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0xA009, OBTS (15)) # УМ-О
                            sleep(1)
                            SCPICMD(0xA01A, OBTS(5), AsciiHex('0x 0000 0000'))
                            sleep(1)
                            #SCPICMD(0xA010, OBTS(5), AsciiHex('0x 0000 0000'))#M3
                            #SCPICMD(0xA00F, OBTS(5), AsciiHex('0x 0000 0000')) #M2
                            SCPICMD(0xA00E, OBTS(5), AsciiHex('0x 0000 0000')) #M1
                            sleep(1)
                            MROD14541()
                            OtklRlci()
                            OtklMROD()
                    elif MPZ1 == '14':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №307 (съемка в режиме 3 - тест матриц 10 с) обе поляризации
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3301 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00F7'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '15':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №308 (съемка в режиме 3 - тест матриц 65 с) обе поляризации
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3401 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0071'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '16':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №307 (съемка в режиме 3 - тест матриц 65 с) левая поляризация
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3301 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '17':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №308 (съемка в режиме 3 - тест матриц 65 с) левая поляризация
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3401 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0086'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '18':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №307 (съемка в режиме 3 - тест матриц 65 с) правая поляризация
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3301 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0041'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
                    elif MPZ1 == '19':
                            vklMROD1(time)
                            vklky()
                            #Сброс тестового МПЗ №308 (съемка в режиме 3 - тест матриц 65 с) правая поляризация
                            Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6030 0030 3401 01FF 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0086'), std=2)) #
                            sleep(1)
                            SCPICMD(0xe051, OBTS (1), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                            sleep(1)
                            SCPICMD(0x6003, OBTS (1))
                            sleep(1)
                            MROD14541()
                            OtklKy()
                            OtklMROD()
            elif MROD == '2':
                print('''
                
                Задайте тип МПЗ для МРОД2:
                0 -- МПЗ съемки 1001 - стирание памяти
                1 -- МПЗ съемки 311 (градиент, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) резервные комплекты
                2 -- МПЗ съемки 312 (ПСП, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) резервные комплекты
                3 -- МПЗ съемки 313 (тест, без сжатия, экспозиция - 0 мсек, длительность - 60 000 мсек) резервные комплекты
                4 -- МПЗ сброса 311 по ку две поляризации
                5 -- МПЗ сброса 311 по х
                6-- МПЗ сброса 312 по ку две поляризации
                7 -- МПЗ сброса 312 по х
                8 -- МПЗ сброса 313 по ку две поляризации
                9 -- МПЗ сброса 313 по х
                ''')
                MPZ2 = input('')
                if MPZ2 == '0':
                    vklMROD2(time)
                    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4038 0038 E903 0000 0000 0000 0000 0000 F401 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0077'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                    sleep(1)
                    MROD212321()
                    OtklMROD()
                elif MPZ2 == '1':
                    #311
                    vklMROD2(time)
                    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4038 0038 3701 0000 FFFF FFFF FFFF FFFF F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00F0'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                    sleep(1)
                    MROD212321()
                    OtklMROD()
                elif MPZ2 == '2':
                    #312
                    vklMROD2(time)
                    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4038 0038 3801 0000 FFFF FFFF FFFF FFFF F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 003B'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                    sleep(1)
                    MROD212321()
                    OtklMROD()
                elif MPZ2 == '3':
                    #313
                    vklMROD2(time)
                    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x4038 0038 3901 0000 FFFF FFFF FFFF FFFF F401 0000 0000 0000 0000 60EA 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 003B'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (30), AsciiHex('0x0000000001000000')) #выдача МПЗ из БЦК
                    sleep(1)
                    MROD212321()
                    OtklMROD()
                elif MPZ2 == '4':
                    vklMROD2(time)
                    vklky2()
                    #Сброс тестового МПЗ №311 (съемка в режиме 0 - градиент 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3701 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0200 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0075'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0x7003, OBTS (1))
                    sleep(1)
                    MROD214541()
                    OtklKy()
                    OtklMROD()
                elif MPZ2 == '5':
                    vklMROD2(time)
                    vklrlci2()
                    #Сброс тестового МПЗ №311 (съемка в режиме 0 - градиент 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3701 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 000C'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0xA00A, OBTS (15)) # УМ-Р
                    sleep(1)
                    MROD214541()
                    OtklRlci()
                    OtklMROD()
                elif MPZ2 == '6':
                    vklMROD2(time)
                    vklky2()
                    #Сброс тестового МПЗ №312 (съемка в режиме 1 - ПСП 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3801 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0200 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 00С2'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0x7003, OBTS (1))
                    sleep(1)
                    MROD214541()
                    OtklKy()
                    OtklMROD()
                elif MPZ2 == '7':
                    vklMROD2(time)
                    vklrlci2()
                    #Сброс тестового МПЗ №312 (съемка в режиме 1 - ПСП 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3801 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0060'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0xA00A, OBTS (15)) # УМ-Р
                    sleep(1)
                    MROD214541()
                    OtklRlci()
                    OtklMROD()
                elif MPZ2 == '8':
                    vklMROD2(time)
                    vklky2()
                    #Сброс тестового МПЗ №313 (съемка в режиме 3 - тест 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3901 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0200 0000 0000 0200 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0093'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0x7003, OBTS (1))
                    sleep(1)
                    MROD214541()
                    OtklKy()
                    OtklMROD()
                elif MPZ2 == '9':
                    vklMROD2(time)
                    vklrlci2()
                    #Сброс тестового МПЗ №313 (съемка в режиме 3 - тест 60 с)
                    Ex.send('КПА', CPIMD(addr=0xA6, data=AsciiHex('0x6038 0038 3901 01FF 0000 0000 0000 0000 FFFF FFFF FFFF FFFF 0200 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0031'), std=2)) #
                    sleep(1)
                    SCPICMD(0xe051, OBTS (15), AsciiHex('0xA600000001000000')) #выдача команды от бцк
                    sleep(1)
                    SCPICMD(0xA00A, OBTS (15)) # УМ-Р
                    sleep(1)
                    MROD214541()
                    OtklRlci()
                    OtklMROD()
        elif d == '2':
            break
