from engineers_src.tools.tools import SCPICMD, AsciiHex, sleep, OBTS, Ex, CPIMD, inputG


def rlci_mpz():
    # включение рлци без ум
    SCPICMD(0xE004, AsciiHex('0113010000000000'))  # ЭА332-О питание опрос
    sleep(1)
    SCPICMD(0xA018)  # ОСТАН ШД
    sleep(1)
    SCPICMD(0xE004, AsciiHex('0111010000000000'))  # ЭА331-О питание опрос
    sleep(1)
    SCPICMD(0xA000)  # ПЧ-О
    sleep(1)
    SCPICMD(0xA003)  # ФИП-О
    sleep(1)
    SCPICMD(0xA006)  # МОД-О
    sleep(1)

    # БСпА 1-ый комплект подать питание (+300 мА)
    SCPICMD(0x43FD)  # Разомкнуть ключ КПТ на БСпА 2
    sleep(1.5)
    SCPICMD(0x5321, AsciiHex('0x 0100 0000 0000 0000'))  # Снять потенциальную команду с БСпАосн
    sleep(1.5)
    SCPICMD(0x5321, AsciiHex('0x 0200 0000 0000 0000'))  # Снять потенциальную команду с БСпАрез
    SCPICMD(0x40DD)  # Замкнуть ключ КПТ на БСпА 1
    sleep(1.5)
    SCPICMD(0x5320, AsciiHex('0x 0100 0000 0000 0000'))  # Выдать потенциальную команду (+Ubs от КПТ) в БСпАосн
    sleep(1.5)
    SCPICMD(0xe06f, AsciiHex('0x 0700 0000 0000 0000'))  # выключение обмена БСпА2
    sleep(1.5)
    SCPICMD(0xe06f, AsciiHex('0x 0601 0000 0000 0000'))  # включение обмена БСпА1
    sleep(1.5)
    # Даем пустую УВ, так как первая УВ не отрабатывается
    SCPICMD(0x6000, AsciiHex('0x0100000000000000'))  # Включение режима "Стартовое=подача питания"
    sleep(1.5)

    # БСпА1 (УВ1, УВ2) включить обмен по UARTосновной с М-778Б основной
    SCPICMD(0x6002, AsciiHex('0x0500000000000000'))  # Переключение текущий МППД на основной
    sleep(1)
    SCPICMD(0x6001, AsciiHex('0x0501000000000000'))  # Закрытие UART2 c 2-ым комплектом М-778Б
    sleep(1)
    SCPICMD(0x6001, AsciiHex('0x0500010000000000'))  # Открытие UART1 c 1-ым комплектом М-778Б
    sleep(1)

    # включение 778
    SCPICMD(0x40CB, OBTS('2000:1:1:0:0:0'), AsciiHex('0x 0000 0000'))  # Замкнуть ключ КПТ на М-778Босновной
    sleep(6)

    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311F00010000000000'), std=2))  # на 778  в бцк (6 мрод)пинг
    sleep(0.5)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1)

    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311F00020000000000'), std=2))  # на 778  в бцк (6 мрод)пинг
    sleep(0.5)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1)

    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311400204E00000000'), std=2))  # на 778  ДИ1 20 сек
    sleep(0.5)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(0.5)

    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311500100000000000'),
                         std=2))  # на 778  запрос ДИ 1 (data = 0x0000) счетчики UART
    sleep(1)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1.5)

    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311400E80300000000'), std=2))  # на 778  ДИ1 1 сек
    sleep(0.5)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1)

    # инициализация НС МРОД 1 в М-778Б
    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64311000000000000000'), std=2))  # на 778  активировать НС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1.5)

    # Сброс тестового МПЗ счетчика левый осн. муксер
    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex(
        '0x6030 0030 FFFF 0000 0000 0000 0000 0000 0000 0000 0000 0000 0100 0000 0000 0000 0100 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0033'),
                         std=2))  #
    sleep(1)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1)

    sleep(41.5)

    # активация ВС МРОД ПК1
    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64310600000000000000'), std=2))  # на 778  активировать ВС МРОД ПК1
    sleep(1)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1.5)

    # активация ВС РЛЦИ ПК1
    Ex.send('КПА', CPIMD(addr=0x0, data=AsciiHex('0x64310E00000000000000'), std=2))  # на 778  активировать ВС РЛЦИ ПК1
    sleep(1)
    SCPICMD(0xe051, AsciiHex('0x0000000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1.5)

    # инициализация ключей
    Ex.send('КПА', CPIMD(addr=0x92, data=AsciiHex('0x64311600010016750000'),
                         std=2))  # установка 1 го набора серии 0x7516 (0d29974), где 0х16 - 22 год, 0х75 - 117 серия)
    sleep(1)
    SCPICMD(0xe051, OBTS(1), AsciiHex('0x9200000001000000'))  # выдача команды от бцк-мрод-778
    sleep(1.5)

    # подготовка к сбросу в МРОД
    SCPICMD(0x6000, AsciiHex('0x0400000000000000'))  # Включение режима "Подготовка к сбросу"
    inputG('Включение режима "Подготовка к сбросу"')

    # включение УМ
    SCPICMD(0xA009)  # УМ-О
    sleep(1.5)
    inputG('Включение режима "УМ-О"')

    # сброс в МРОД
    SCPICMD(0x6000, AsciiHex('0x0500000000000000'))  # Включение режима "Cброс"
    sleep(5)
    inputG('Включение режима "Cброс"')

    SCPICMD(0x6000, AsciiHex('0x0400000000000000'))  # Включение режима "Подготовка к сбросу"
    sleep(5)
    inputG('Включение режима "Подготовка к сбросу"')

    SCPICMD(0x6000, AsciiHex('0x0100000000000000'))  # Включение режима "Дежурный"
    sleep(5)
